#Область ПрограммныйИнтерфейс
//Функция обходит элементы справочника Уведомления
// Возвращаемое значение: 
// Массив:
// Тип элемента коллекции - Структура - Получить данные для отправки
Функция ПолучитьДанныеДляОтправки() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВКМ_УведомленияТелеграмБоту.Ссылка КАК Ссылка,
	|	ВКМ_УведомленияТелеграмБоту.ТекстСообщения КАК ТекстСообщения
	|ИЗ
	|	Справочник.ВКМ_УведомленияТелеграмБоту КАК ВКМ_УведомленияТелеграмБоту";

	Выборка = Запрос.Выполнить().Выбрать();

	ДанныеДляОтправки = Новый Массив;

	Пока Выборка.Следующий() Цикл
		Уведомление = Новый Структура;
		Уведомление.Вставить("Идентификатор", Строка(Выборка.Ссылка.УникальныйИдентификатор()));
		Уведомление.Вставить("chat_id", Константы.ВКМ_ИдентификаторГруппыДляОповещения.Получить());
		Уведомление.Вставить("text", Выборка.ТекстСообщения);
		ДанныеДляОтправки.Добавить(Уведомление);
	КонецЦикла;

	Возврат ДанныеДляОтправки;

КонецФункции
//Функция удалят отправленные элементы справочника Уведомления
//@skip-check doc-comment-parameter-section
Процедура УдалитьОтправленныеУведомления(Идентификатор) Экспорт
	Ссылка = Справочники.ВКМ_УведомленияТелеграмБоту.ПолучитьСсылку(Новый УникальныйИдентификатор(Идентификатор));
	СпрОбъект = Ссылка.ПолучитьОбъект();
	СпрОбъект.Удалить();
КонецПроцедуры

#КонецОбласти