#Область ПрограммныйИнтерфейс
//Функция обходит элементы справочника Уведомления
//Возвращаемое значение:
//  Массив:
//  Структур - ДанныеДляОтправки
//   * Идентификатор  - Строка - УникальныйИдентификатор;
//   * ТекстСообщения      - Строка - ТекстСообщения;
//@skip-check doc-comment-collection-item-type
Функция ПолучитьДанныеДляОтправки() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_УведомленияТелеграмБоту.Ссылка КАК Ссылка,
		|	ВКМ_УведомленияТелеграмБоту.ТекстСообщения КАК ТекстСообщения
		|ИЗ
		|	Справочник.ВКМ_УведомленияТелеграмБоту КАК ВКМ_УведомленияТелеграмБоту";
	
	Выборка = Запрос.Выполнить().Выбрать();  
	ДанныеДляОтправки = Новый Массив;
		
	Пока Выборка.Следующий() Цикл
		Уведомление = Новый Структура;
		Уведомление.Вставить("Идентификатор",Строка(Выборка.Ссылка.УникальныйИдентификатор()));
        Уведомление.Вставить("ТекстСообщения", Выборка.ТекстСообщения);
		ДанныеДляОтправки.Добавить(Уведомление);
	КонецЦикла; 
	
	Возврат ДанныеДляОтправки;
	
КонецФункции
//Функция удалят отправленные элементы справочника Уведомления
//@skip-check doc-comment-parameter-section
Процедура УдалитьОтправленныеУведомления(СправочникиНаУдаление) Экспорт
	
	Для Каждого Элемент Из СправочникиНаУдаление Цикл
		Ссылка = Справочники.ВКМ_УведомленияТелеграмБоту.ПолучитьСсылку(Новый УникальныйИдентификатор(Элемент.Идентификатор));
		СпрОбъект = Ссылка.ПолучитьОбъект();
		СпрОбъект.Удалить(); 		
	КонецЦикла;	
	
КонецПроцедуры     

#КонецОбласти 

