#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	ПериодПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ВКМ_СформироватьАктыЗапериод(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.Период) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Период не заполнен";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	ВКМ_СформироватьАктыЗапериодНаСервере(Объект.Период);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПериодПриИзмененииНаСервере()	
	СформироватьСписокДокументов();	
КонецПроцедуры

&НаСервере
Процедура СформироватьСписокДокументов()
	
	Перем Запрос;
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Ссылка КАК Договор,
		|	ВложенныйЗапрос.Ссылка КАК Реализация
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			РеализацияТоваровУслуг.Ссылка КАК Ссылка,
		|			РеализацияТоваровУслуг.Контрагент КАК Контрагент,
		|			РеализацияТоваровУслуг.Договор КАК Договор
		|		ИЗ
		|			Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|		ГДЕ
		|			РеализацияТоваровУслуг.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания) КАК ВложенныйЗапрос
		|		ПО (ДоговорыКонтрагентов.Ссылка = ВложенныйЗапрос.Договор)
		|ГДЕ
		|	ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание)";
		
	Запрос.УстановитьПараметр("ДатаНачала", НачалоМесяца(Объект.Период));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецМесяца(Объект.Период));
	Объект.СписокДоговоров.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаСервере
Процедура ВКМ_СформироватьАктыЗапериодНаСервере(Период)
	 ВКМ_ФормированиеАктов.ВКМ_СФормироватьАктыЗаПериод(Период);
	 СформироватьСписокДокументов();		
КонецПроцедуры

#КонецОбласти
