#Область ПрограммныйИнтерфейс
//Процедура формирует акты за период
//Параметры:
//        Период - Дата- Период формирования актов;
//Возвращаемое значение:
//        СозданныеДокументы -Массив- Ссылки на сформированные реализации;
Процедура ВКМ_СФормироватьАктыЗаПериод(Период) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Ссылка КАК Ссылка,
		|	ВложенныйЗапрос.Ссылка КАК Реализация,
		|	ДоговорыКонтрагентов.Владелец,
		|	ДоговорыКонтрагентов.Организация
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			РеализацияТоваровУслуг.Ссылка КАК Ссылка,
		|			РеализацияТоваровУслуг.Контрагент КАК Контрагент,
		|			РеализацияТоваровУслуг.Договор КАК Договор
		|		ИЗ
		|			Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|		ГДЕ
		|			РеализацияТоваровУслуг.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания) КАК ВложенныйЗапрос
		|		ПО (ДоговорыКонтрагентов.Ссылка = ВложенныйЗапрос.Договор)
		|ГДЕ
		|	ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание)
		|	И ВложенныйЗапрос.Ссылка ЕСТЬ NULL";
		
	Запрос.УстановитьПараметр("ДатаНачала", НачалоМесяца(Период));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецМесяца(Период));
	
	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		ДокОбъект = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
		ДокОбъект.Дата = НачалоМесяца(Период);
		ДокОбъект.Организация = Выборка.Организация;
		ДокОбъект.Контрагент = Выборка.Владелец;
		ДокОбъект.Договор = Выборка.Ссылка;
		ДокОбъект.Основание = Выборка.Ссылка;
		ДокОбъект.Ответственный = Пользователи.ТекущийПользователь();
		ДокОбъект.Комментарий = "Создан автоматической обработкой";
		ДокОбъект.Записать();
		ДокОбъект.ВКМ_ВыполнитьАвтозаполнение(ДокОбъект.Ссылка);
		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);	
	КонецЦикла;
		
КонецПроцедуры     

#КонецОбласти