#Область ОбработчикиСобытийЭлементовТаблицыФормыВыплаты
&НаКлиенте
Процедура ВыплатыСуммаПриИзменении(Элемент)
	//ТекущиеДанные = Элементы.Выплаты.ТекущиеДанные;
	РассчитатьСуммуДокумента();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Объект.Выплаты.Очистить();
	Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.Сотрудник КАК Сотрудник,
	|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.СуммаОстаток КАК Сумма
	|ИЗ
	|	РегистрНакопления.ВКМ_ВзаиморасчетыССотрудниками.Остатки(&Дата, ) КАК ВКМ_ВзаиморасчетыССотрудникамиОстатки";
	
	Запрос.УстановитьПараметр("Дата", КонецДня(Объект.Дата));
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.Выплаты.Добавить();
		НоваяСтрока.Сотрудник = Выборка.Сотрудник;
		НоваяСтрока.Сумма = Выборка.Сумма;
	КонецЦикла; 
	Объект.СуммаДокумента = Объект.Выплаты.Итог("Сумма");
КонецПроцедуры 

&НаКлиенте
Процедура РассчитатьСуммуДокумента()	
	Объект.СуммаДокумента = Объект.Выплаты.Итог("Сумма");	
КонецПроцедуры

#КонецОбласти

