
Функция SendPOSTSend(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);  
	
	НачалоЗамера = ОценкаПроизводительности.НачатьЗамерВремени();
	
	Попытка
		Ответ = ВКМ_Телеграм.ОтправитьИУдалитьУведомления(Запрос);
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();  
		Ответ = ВКМ_Телеграм.ОтветОбОшибке(ИнформацияОбОшибке); 
	КонецПопытки;
	
	ОценкаПроизводительности.ЗакончитьЗамерВремениТехнологический("bots.send",НачалоЗамера);
	
	Возврат Ответ;
КонецФункции

Функция PingGETPing(Запрос)
	Возврат ВКМ_Телеграм.ПростойУспешныйОтвет(); 
КонецФункции
