#Область ПрограммныйИнтерфейс
//Функция создает защищённое соединение с сервером "api.telegram.org"
//Возвращаемое значение:
//  HTTPОтвет
Функция ОтправитьИУдалитьУведомления(Запрос) Экспорт
	
	ПараметрыПодключения = Новый Структура;
	АдресСервера = "api.telegram.org";
	ПараметрыПодключения.Вставить("ЗащищенноеСоединение", Новый ЗащищенноеСоединениеOpenSSL);
	ПараметрыПодключения.Вставить("АдресСервера",АдресСервера); 
    Токен = Константы.ВКМ_ТокенУправленияТелеграмБотом.Получить();
	
	Соединение = Новый HTTPСоединение(ПараметрыПодключения.АдресСервера,,,,,20,ПараметрыПодключения.ЗащищенноеСоединение);
    АдресРесурса = ПараметрыПодключения.АдресСервера + "/bot" + Токен + "/sendMessage"; 
	
	//ДанныеДляОтправки = ВКМ_РегламентноеЗаданиеСправочникУведомления.ПолучитьДанныеДляОтправки();
	//Уведомления = СериализоватьВJSON(ДанныеДляОтправки);
	    
	Запрос = Новый HTTPЗапрос(АдресРесурса);  
	
	Заголовок = Новый Соответствие;	
	Заголовок.Вставить("Content-Type","application/json"); 
	
	Сообщение = Новый Структура;
	Сообщение.Вставить("chat_id", Константы.ВКМ_ИдентификаторГруппыДляОповещения.Получить());
	Сообщение.Вставить("text", "ТекстСообщения");
	
	Запись = Новый ЗаписьJSON;
	Запись.УстановитьСтроку();
	ЗаписатьJSON(Запись,Сообщение);
	ТелоЗапроса = Запись.Закрыть();

	Запрос.УстановитьТелоИзСтроки(ТелоЗапроса); 
	
	Соединение.ОтправитьДляОбработки(Запрос);
	Ответ = Соединение.ВызватьHTTPМетод("POST", Запрос); 
	Сообщить("Код состояния: "+ Ответ.КодСостояния);
	
	Если Ответ.КодСостояния = 200 Тогда 
		СправочникиНаУдаление = ДесериализоватьИзJSON(ТелоЗапроса);
	    ВКМ_РегламентноеЗаданиеСправочникУведомления.УдалитьОтправленныеУведомления(СправочникиНаУдаление);
	КонецЕсли;   

	Возврат Ответ;   
		
КонецФункции

Функция ОтветОбОшибке(ИнформацияОбОшибке) Экспорт 
	ЗаписьЖурналаРегистрации("HTTPСервисы.Ошибка", УровеньЖурналаРегистрации.Ошибка,ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
	Результат = Новый Структура;
	Результат.Вставить("Result", "Error"); 
	Результат.Вставить("ErrorText", КраткоеПредставлениеОшибки(ИнформацияОбОшибке)); 
	Возврат ОтветJSON(Результат, 500); 
КонецФункции 

Функция СериализоватьВJSON(ДанныеДляОтправки) Экспорт
	Запись = Новый ЗаписьJSON;
	Запись.УстановитьСтроку();
	ЗаписатьJSON(Запись,ДанныеДляОтправки);
	Уведомления = Запись.Закрыть();
	Возврат Уведомления;	
КонецФункции

Функция ОтветJSON(Объект, КодСостояния = 200) Экспорт
	Ответ = Новый HTTPСервисОтвет(КодСостояния);
	Ответ.УстановитьТелоИзСтроки(СтрокаJSON(Объект));
	Ответ.Заголовки.Вставить("Content-Type", "application/json");
	Возврат Ответ;
КонецФункции

Функция СтрокаJSON(ОбъектJSON) Экспорт
	ПараметрыЗаписи = Новый ПараметрыЗаписиJSON(,Символы.Таб);
	Запись = Новый ЗаписьJSON;
	Запись.УстановитьСтроку(ПараметрыЗаписи);
	ЗаписатьJSON(Запись, ОбъектJSON);
	Возврат Запись.Закрыть();
КонецФункции

Функция ДесериализоватьИзJSON(ДанныеДляОтправки)
	
	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(ДанныеДляОтправки); 
	СправочникиНаУдаление = ПрочитатьJSON(Чтение);
	Чтение.Закрыть();
	Возврат СправочникиНаУдаление;
	
КонецФункции 

#КонецОбласти 

