#Область ОбработчикиСобытийЭлементовТаблицыФормыОтпускаСотрудников

&НаКлиенте
Процедура ОтпускаСотрудниковДатаНачалаПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ОтпускаСотрудников.ТекущиеДанные; 
	ТекущиеДанные.КолДней = (ТекущиеДанные.ДатаОкончания - ТекущиеДанные.ДатаНачала) / (24 * 3600) + 1;
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковДатаОкончанияПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ОтпускаСотрудников.ТекущиеДанные; 
	ТекущиеДанные.КолДней = (ТекущиеДанные.ДатаОкончания - ТекущиеДанные.ДатаНачала) / (24 * 3600) + 1; 
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура АнализГрафика(Команда)
	
	ПараметрыФормы = Новый Структура("АдресХранилища", ПоместитьДанныеВоВременноеХранилище());
	
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика", ПараметрыФормы)
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПоместитьДанныеВоВременноеХранилище() 	
	Отпуска = Новый Массив;	
	Для Каждого Строка Из Объект.ОтпускаСотрудников Цикл
		СтрокаТЧ = Новый Структура;
		СтрокаТЧ.Вставить("Сотрудник", Строка.Сотрудник);
		СтрокаТЧ.Вставить("ДатаНачала", Строка.ДатаНачала);
		СтрокаТЧ.Вставить("ДатаОкончания", Строка.ДатаОкончания);
		Отпуска.Добавить(СтрокаТЧ);
	КонецЦикла;  	
	АдресХранилища = ПоместитьВоВременноеХранилище(Отпуска, УникальныйИдентификатор);
	Возврат АдресХранилища;	
КонецФункции

#КонецОбласти