#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим)
	
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ОбслуживаниеКлиента.Клиент КАК Клиент,
		|	ВКМ_ОбслуживаниеКлиента.Договор КАК Договор,
		|	ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.ЧасыКОплатеКлиенту КАК ЧасыКОплатеКлиенту,
		|	ДоговорыКонтрагентов.ВКМ_СтоимостьЧаса КАК ВКМ_СтоимостьЧаса
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиента.ВыполненныеРаботы КАК ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|			ПО ВКМ_ОбслуживаниеКлиента.Договор = ДоговорыКонтрагентов.Ссылка
		|		ПО ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.Ссылка = ВКМ_ОбслуживаниеКлиента.Ссылка
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиента.Дата МЕЖДУ ДоговорыКонтрагентов.ВКМ_ДатаНачалаДействия И ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДействия
		|	И ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.Ссылка = &Ссылка
		|ИТОГИ
		|	МАКСИМУМ(Договор),
		|	СУММА(ЧасыКОплатеКлиенту),
		|	МАКСИМУМ(ВКМ_СтоимостьЧаса)
		|ПО
		|	Клиент";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаКлиент = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
	
	Если ВыборкаКлиент.Количество()=0 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Дата документа не соответствует договору";
		Сообщение.Сообщить();
	КонецЕсли;
	
	Пока ВыборкаКлиент.Следующий() Цикл
		Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Клиент = Клиент;
		Движение.Договор = Договор;
		Движение.КоличествоЧасов = ВыборкаКлиент.ЧасыКОплатеКлиенту;
		Движение.СуммаКОплате = ВыборкаКлиент.ВКМ_СтоимостьЧаса * Движение.КоличествоЧасов;
	КонецЦикла;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда 
    	Возврат; 
    КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВКМ_ОбслуживаниеКлиента.Дата КАК Дата,
	|	ВКМ_ОбслуживаниеКлиента.ДатаПроведенияРабот КАК ДатаПроведенияРабот,
	|	ВКМ_ОбслуживаниеКлиента.ВремяНачалаРаботПлан КАК ВремяНачалаРаботПлан,
	|	ВКМ_ОбслуживаниеКлиента.ВремяОкончанияРаботПлан КАК ВремяОкончанияРаботПлан,
	|	ВКМ_ОбслуживаниеКлиента.Специалист КАК Специалист
	|ИЗ
	|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
	|ГДЕ
	|	ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Результат = Запрос.Выполнить(); 
	Выборка = Результат.Выбрать(); 
	
	Если Выборка.Следующий() Тогда 
		ДокДатаПроведенияРабот = Выборка.ДатаПроведенияРабот;
		ДокВремяНачалаРаботПлан = Выборка.ВремяНачалаРаботПлан;
		ДокВремяОкончанияРаботПлан = Выборка.ВремяОкончанияРаботПлан;
		ДокСпециалист = Выборка.Специалист;
	КонецЕсли;
	
	Если ДокДатаПроведенияРабот <> ДатаПроведенияРабот Тогда
		Текст1 = " дата проведения работ изменилась на "+ Формат(ДатаПроведенияРабот, "ДФ=dd.MM.yyyy");
	КонецЕсли; 
	
	Если ДокВремяНачалаРаботПлан <> ВремяНачалаРаботПлан Тогда
		Текст2 = " время начала работ изменилось на "+ Формат(ВремяНачалаРаботПлан, "ДФ=HH.mm");
	КонецЕсли;
	
	Если ДокВремяОкончанияРаботПлан <> ВремяОкончанияРаботПлан Тогда
		Текст3 = " время окончания работ изменилось на "+ Формат(ВремяОкончанияРаботПлан, "ДФ=HH.mm");
	КонецЕсли;
	
	Если ДокСпециалист <> Специалист Тогда
		Текст4 = " замена специалиста, к Вам приедет "+ Специалист;
	КонецЕсли;
	
	Текст = "" + Текст1 + ?(НЕ ПустаяСтрока(Текст2), ",", "") + Текст2 + ?(НЕ ПустаяСтрока(Текст3), ",", "") + Текст3 + ?(НЕ ПустаяСтрока(Текст4), ",", "") + Текст4;
	
	Если НЕ ПустаяСтрока(Текст) Тогда 
		СпрОбъект = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
		СпрОбъект.ТекстСообщения = "Уважаемый клиент, в вашем заказе произошли изменения:" + Текст + ".";
		СпрОбъект.Записать();
	КонецЕсли;  
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
