#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокСотрудников

&НаКлиенте
Процедура СписокСотрудниковСотрудникПриИзменении(Элемент)
	//ТекущиеДанные = Элементы.СписокСотрудников.ТекущиеДанные;
	РассчитатьСуммуДокумента();
КонецПроцедуры

&НаКлиенте
Процедура СписокСотрудниковСуммаПремииПриИзменении(Элемент)
	//ТекущиеДанные = Элементы.СписокСотрудников.ТекущиеДанные;
	РассчитатьСуммуДокумента();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура РассчитатьСуммуДокумента()	
	Объект.СуммаДокумента = Объект.СписокСотрудников.Итог("СуммаПремии");	
КонецПроцедуры

#КонецОбласти